#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = ['aaa', 'bbb', 'ccc', 'ddd', 'eee']

# list tuple str都可进行切片操作

# 取前3个元素
# 从0-3 不包括3
print(L[0:3]) # ['aaa', 'bbb', 'ccc']
# 第一个索引是0 可以省略
print(L[:3])  # ['aaa', 'bbb', 'ccc']

# 倒数切片 取后两个元素
print(L[-2:]) # ['ddd', 'eee']
print(L[-2:]) # ['eee']

L1 = list(range(100))

# 取前10个数
print(L1[:10]) # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# 取后十个数
print(L1[-10:]) # [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

# 前十个数 每两个取一个
print(L1[:10:2]) # [0, 2, 4, 6, 8]

# 所有数 每5个取一个
print(L1[::5]) # [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]